Revit 2026 API

# IFCDataAsString Method

---

Gets storage value as string when its PrimitiveType is string, binary or enumeration.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string AsString()
```
```vb
Public Function AsString As String
```
```cpp
public:
String^ AsString()
```
```fsharp
member AsString : unit -> string
```

#### Return Value

String The string value.

| Exception | Condition |
| --- | --- |
| InapplicableDataException | The primitive type is not string, binary or enumeration. |

#### Reference

IFCData Class

Autodesk.Revit.DB.IFC Namespace